Repository: capstanlqc-mtpe/CIDQ_BillingCode2026_fr-CA_omt
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr_ca

source: Elevator machine rooms, control rooms, control spaces and machinery spaces outside of but attached to a hoistway that have openings into the hoistway shall be enclosed with fire barriers constructed in accordance with Section 707 or horizontal assemblies constructed in accordance with Section 711, or both.
fr_ca: Les locaux des machines d’ascenseur, les locaux de commande, les espaces de commande et les locaux de machinerie situés à l’extérieur d’un puits mais qui y sont attenants et qui comportent des ouvertures donnant sur le puits doivent être encloisonnés par des séparations coupe-feu construites conformément à la section 707 ou par des ensembles horizontaux construits conformément à la section 711, ou par les deux.

source: Elevator machine rooms, machinery spaces that contain the driving machine, and control rooms or spaces that contain the operation or motion controller for elevator operation shall be provided with an independent ventilation or air-conditioning system to protect against the overheating of the electrical equipment.
fr_ca: Les locaux des machines d’ascenseur, les locaux de machinerie qui abritent la machine d’entraînement et les locaux ou espaces de commande qui abritent le contrôleur de fonctionnement ou de mouvement des ascenseurs doivent être pourvus d’un système indépendant de ventilation ou de climatisation afin de protéger l’équipement électrique contre la surchauffe.

source: Except as indicated in Section 2406.3.1, each pane of safety glazing installed in hazardous locations shall be identified by a manufacturer’s designation specifying who applied the designation, the manufacturer or installer and the safety glazing standard with which it complies, as well as the information specified in Section 2403.1.
fr_ca: Sauf dans les cas indiqués à la section 2406.3.1, chaque vitre de vitrage de sécurité installée dans des emplacements dangereux doit être identifiée par une désignation du fabricant précisant qui a apposé la désignation, le fabricant ou l’installateur, ainsi que la norme relative aux vitrages de sécurité à laquelle elle est conforme, et comportant également les renseignements précisés à la section 2403.1.

source: Float, wired and patterned glass in louvered windows and jalousies shall be not thinner than nominal 3/16 inch (4.8 mm) and not longer than 48 inches (1219 mm).
fr_ca: Les vitrages flottés, armés et imprimés des fenêtres à lames et des fenêtres à jalousies ne doivent pas avoir une épaisseur nominale inférieure à 3/16 po (4,8 mm) ni une longueur supérieure à 48 po (1 219 mm).

source: Floor designations shall be provided in raised characters and braille complying with Sections 703.3 and 703.4.
fr_ca: Les désignations d'étage doivent être prévues en caractères en relief et en braille conformément aux sections 703.3 et 703.4.

source: Glass used in a handrail or a guard shall be laminated glass constructed of fully tempered or heat-strengthened glass and shall comply with Category II or CPSC 16 CFR Part 1201 or Class A of ANSI Z97.1.
fr_ca: Le verre utilisé dans une main courante ou un garde-corps doit être un verre feuilleté constitué de verre entièrement trempé ou de verre durci par traitement thermique et doit être conforme à la catégorie II de la norme CPSC 16 CFR Part 1201 ou à la classe A de la norme ANSI Z97.1.

source: Glazing in walls, enclosures or fences containing or facing hot tubs, spas, whirlpools, saunas, steam rooms, bathtubs, showers and indoor or outdoor swimming pools where the bottom exposed edge of the glazing is less than 60 inches (1524 mm) measured vertically above any standing or walking surface shall be considered to be a hazardous location.
fr_ca: Les vitrages dans les murs, enceintes ou clôtures contenant des cuves thermales, spas, cuves à remous, saunas, bains de vapeur, baignoires et piscines intérieures ou extérieures, ou leur faisant face, lorsque le bord inférieur exposé du vitrage se trouve à moins de 60 po (1 524 mm), mesuré verticalement au-dessus de toute surface où l’on peut se tenir debout ou circuler, doivent être considérés comme étant situés dans un emplacement dangereux.

source: Grab bars shall comply with Section 609 and shall be provided in accordance with Section 608.3.
fr_ca: Les barres d'appui doivent être conformes à la section 609 et prévues selon la section 608.3.

source: Ground-fault circuit-interrupters shall be installed in a readily accessible location.
fr_ca: Les disjoncteurs de fuite à la terre doivent être installés dans un endroit facilement accessible.

source: Group R occupancies shall be equipped throughout with an automatic sprinkler system in accordance with Section 903.2.8.
fr_ca: Les usages du groupe R doivent être entièrement équipés d’un système d’extincteurs automatiques conformément à la section 903.2.8.

source: Hallways of 10 feet (3048 mm) or more in length shall have at least one receptacle outlet.
fr_ca: Les couloirs d'une longueur de 10 pi [3048 mm] ou plus doivent avoir au moins une prise de courant.

source: In attics, under- floor spaces, utility rooms and basements, at least one lighting outlet shall be installed where these spaces are used for storage or contain equipment requiring servicing.
fr_ca: Dans les greniers, les espaces sous le plancher, les salles de service et les sous-sols, au moins une prise d'éclairage doit être installée lorsque ces espaces sont utilisés pour l'entreposage ou contiennent de l'équipement nécessitant un entretien.

source: Lighting outlets shall be provided in accordance with Sections E3903.2 through E3903.4.
fr_ca: Les prises d'éclairage doivent être prévues selon les sections E3903.2 à E3903.4.

source: Not fewer than two drinking fountains shall be provided.
fr_ca: Pas moins de deux abreuvoirs doivent être prévus.

source: Not less than one receptacle outlet that is readily accessible from grade level and located not more than 6 feet, 6 inches (1981 mm) above grade, shall be installed outdoors at the front and back of each dwelling unit having direct access to grade level.
fr_ca: Au moins une prise de courant facilement accessible depuis le niveau du sol et située à moins de 6 pi 6 po (1981 mm) au-dessus du sol doit être installée à l'extérieur à l'avant et à l'arrière de chaque logement ayant un accès direct au niveau du sol.

source: Outlets for receptacles rated at 125 volts, 15- and 20-amperes shall be provided in accordance with Sections E3901.2 through E3901.11.
fr_ca: Les prises de courant pour les prises de 125 volts, 15 et 20 ampères doivent être prévues selon les sections E3901.2 à E3901.11.

source: Pictograms shall have a field 6 inches (150 mm) minimum in height.
fr_ca: Les pictogrammes doivent avoir un champ d'une hauteur minimale de 6 po [150 mm].

source: Raised character stroke width shall comply with Section 703.3.7.
fr_ca: La largeur de trait des caractères en relief doit être conforme à la section 703.3.7.

source: Receptacles shall be installed so that no point measured horizontally along the floor line of any wall space is more than 6 feet (1829 mm), from a receptacle outlet.
fr_ca: Les prises de courant doivent être installées de manière à ce qu'aucun point mesuré horizontalement le long de la ligne de plancher d'un espace mural ne soit à plus de 6 pieds (1 829 mm) d'une prise de courant.

source: Standard roll-in-type shower compartments shall have a clear inside dimension of 60 inches (1525 mm) minimum in width and 30 inches (760 mm) minimum in depth, measured at the center point of opposing sides.
fr_ca: Les compartiments de douche standard de type à l'italienne doivent avoir des dimensions intérieures libres d'au moins 60 po [1525 mm] en largeur et d'au moins 30 po [760 mm] en profondeur, mesurées au point central des côtés opposés.

source: Symbols of accessibility and their backgrounds shall have a non-glare finish.
fr_ca: Les symboles d'accessibilité et leurs fonds doivent avoir une finition antireflet.

source: The height of shower compartment seats shall be 17 inches (430 mm) minimum and 19 inches (485 mm) maximum above the bathroom floor, measured to the top of the seat.
fr_ca: Les sièges de la cabine de douche doivent se trouver à une hauteur comprise entre 17 po (430 mm) et 19 po (485 mm) au-dessus du sol de la salle de bain, mesurée jusqu'à la partie supérieure du siège.

source: The provisions of this chapter shall govern the materials, design, construction and quality of glass, light-transmitting ceramic and light-transmitting plastic panels for exterior and interior use in both vertical and sloped applications in buildings and structures.
fr_ca: Les dispositions du présent chapitre régissent les matériaux, la conception, la construction et la qualité des vitrages, des panneaux de céramique transmettant la lumière et des panneaux de plastique transmettant la lumière destinés à être utilisés à l’extérieur et à l’intérieur, dans les applications verticales et inclinées des bâtiments et des constructions.

source: The uppercase letter “I” shall be used to determine the allowable height of all characters of a font.
fr_ca: La lettre majuscule « I » doit être utilisée pour déterminer la hauteur autorisée de tous les caractères d'une police.

source: The uppercase letter “I” shall be used to determine the allowable stroke width of all characters of a font.
fr_ca: La lettre majuscule « I » doit être utilisée pour déterminer la largeur de trait admissible de tous les caractères d'une police.

source: The uppercase letter “O” shall be used to determine the allowable width of all characters of a font.
fr_ca: La lettre majuscule « O » doit être utilisée pour déterminer la largeur autorisée de tous les caractères d'une police.

source: Thresholds in roll-in-type shower compartments shall be 1/2 inch (13 mm) maximum in height in accordance with Section 303.
fr_ca: Les seuils dans les cabines de douche de type à accès de plain-pied doivent être d'une hauteur maximale de 1/2 po (13 mm) selon la section 303.

source: Transfer-type shower compartments shall have a clear inside dimension of 36 inches (915 mm) in width and 36 inches (915 mm) in depth, measured at the center point of opposing sides.
fr_ca: Les compartiments de douche de type transfert doivent avoir des dimensions intérieures libres de 36 po [915 mm] de largeur et de 36 po [915 mm] de profondeur, mesurées au point central des côtés opposés.

source: Visible signal fixtures shall be centered at 72 inches (1830 mm) minimum above the floor.
fr_ca: Les dispositifs de signalisation visibles doivent être centrés à au moins 72 po [1830 mm] au-dessus du sol.

source: Visual characters shall be 40 inches (1015 mm) minimum above the floor of the viewing position, measured to the baseline of the character.
fr_ca: Les caractères visuels doivent être à une hauteur minimale de 40 po [1015 mm] au-dessus du sol de la position de visualisation, mesurée jusqu'à la ligne de base du caractère.

source: Where a sign containing raised characters and braille is provided at a door, the sign shall be alongside the door at the latch side.
fr_ca: Lorsqu'un panneau contenant des caractères en relief et du braille est prévu sur une porte, le panneau doit être placé à côté de la porte, du côté de la serrure.

source: Where elevator call buttons or keypads are provided, they shall comply with Sections 407.2.1 and 309.4.
fr_ca: Lorsque des boutons d'appel d'ascenseur ou des claviers sont prévus, ils doivent être conformes aux sections 407.2.1 et 309.4.

source: Where elevator hoistways, elevator machine rooms, control rooms and control spaces containing elevator control equipment are protected with automatic sprinklers, a means installed in accordance with Section 21.4 of NFPA 72 shall be provided to automatically disconnect the main line power supply to the affected elevator prior to the application of water.
fr_ca: Lorsque les puits d’ascenseur, les locaux des machines d’ascenseur, les locaux de commande et les espaces de commande contenant de l’équipement de commande des ascenseurs sont protégés par des systèmes automatiques d’extinction, un dispositif installé conformément à la section 21.4 de la norme NFPA 72 doit être prévu afin de couper automatiquement l’alimentation électrique principale de l’ascenseur concerné avant l’application de l’eau.

source: Where elevators are provided in buildings four or more stories above or four or more stories below, grade plane, not fewer than one elevator shall be provided for fire department emergency access to all floors.
fr_ca: Lorsque des ascenseurs sont prévus dans des bâtiments situés à quatre étages ou plus au-dessus ou à quatre étages ou plus au-dessous du plan de référence du sol, au moins un ascenseur doit être prévu pour permettre l’accès d’urgence du service d’incendie à tous les étages.

source: Where lavatories are provided, at least 5 percent, but not less than one, shall be accessible.
fr_ca: Lorsque des lavabos sont prévus, au moins 5 pour cent de ceux-ci, mais pas moins d'un, doivent être accessibles.

source: Where required by other sections of this code, glazing shall be tested in accordance with CPSC 16 CFR Part 1201.
fr_ca: Lorsque d'autres sections du présent code l'exigent, le vitrage doit être testé conformément à la norme CPSC 16 CFR Partie 1201.

source: Where water closet compartments are provided in a toilet room or bathing room, at least 5 percent of the total number of compartments shall be wheelchair accessible.
fr_ca: Lorsque des compartiments de toilettes sont prévus dans une salle de toilettes ou une salle de bain, au moins 5 pour cent du nombre total de compartiments doivent être accessibles aux chaises roulantes.

source: E3901.4 Countertop and work surface receptacles.
fr_ca: E3901.4 Prises de comptoir et de surface de travail.

source: E3903.1 General.
fr_ca: E3903.1 Généralités.

source: Lavatories shall comply with Section 606.
fr_ca: Les lavabos doivent être conformes à la section 606.

source: Nosings within a stairway shall be uniform.
fr_ca: Les nez de marche d'un escalier doivent être uniformes.

source: A 1-foot-candle (10.8 lux) minimum illumination at times other than conditions of stair use
fr_ca: Un éclairage minimum de 1 pied-bougie (10,8 lux) à des moments autres que les conditions d'utilisation de l'escalier

source: A 1-hour fire-resistance rating is required for smoke barriers.
fr_ca: Un degré de résistance au feu d'une heure est requis pour les pare-fumée.

source: A 10-foot-candle (108 lux) minimum illumination during conditions of stair use
fr_ca: Un éclairage minimum de 10 pieds-bougies [108 lux] pendant les conditions d'utilisation de l'escalier

source: A bench complying with Section 903 shall be provided within the room.
fr_ca: Un banc conforme à la Section 903 doit être prévu dans la pièce.

source: A building or structure shall not be used or occupied in whole or in part, and a change of occupancy of a building or structure or portion thereof shall not be made, until the building official has issued a certificate of occupancy therefor as provided herein.
fr_ca: Un bâtiment ou une structure ne doit pas être utilisé ou occupé, en tout ou en partie, et aucun changement d’usage d’un bâtiment ou d’une structure, ou d’une partie de ceux-ci, ne doit être effectué avant que le fonctionnaire responsable du bâtiment ait délivré à cet égard un certificat d’occupation conformément aux présentes.

source: A building, room or space used for assembly purposes that has an occupant load of greater than 300 and is provided with a main exit, that main exit shall be of sufficient capacity to accommodate not less than one-half of the occupant load, but such capacity shall be not less than the total required capacity of all means of egress leading to the exit.
fr_ca: Un bâtiment, une salle ou un espace utilisé à des fins d’assemblée dont la charge d’occupation est supérieure à 300 personnes et qui est muni d’une issue principale doit avoir une issue principale d’une capacité suffisante pour accueillir au moins la moitié de la charge d’occupation; toutefois, cette capacité ne doit pas être inférieure à la capacité totale requise de tous les moyens d’évacuation menant à l’issue.

source: A button or switch shall be provided on the public side of the unit primary entrance.
fr_ca: Un bouton ou un interrupteur doit être prévu du côté public de l'entrée principale du logement.

source: A certificate of occupancy required by Section 111 shall not be issued until the floor load signs, required by Section 106.1, have been installed.
fr_ca: Le certificat d’occupation exigé à l’article 111 ne doit pas être délivré tant que les panneaux indiquant les charges des planchers, exigés à l’article 106.1, n’ont pas été installés.

source: A change in use of an elevator from freight to passenger, passenger to freight, or from one freight class to another freight class shall comply with Section 8.7 of ASME A17.1/CSA B44.
fr_ca: Toute modification de l’usage d’un ascenseur, de transport de marchandises à transport de passagers, de transport de passagers à transport de marchandises ou d’une classe de transport de marchandises à une autre doit être conforme à la section 8.7 de la norme ASME A17.1/CSA B44.

source: A changing surface shall be provided and shall comply with Section 613.4.
fr_ca: Une surface à langer doit être prévue et doit être conforme à la section 613.4.

source: A circulation path complying with Section 1105.5 shall connect the unit entrance complying with Section 1105.2 and with the spaces specified in Section 1105.4.
fr_ca: Une voie de circulation conforme à la Section 1105.5 doit relier l'entrée du logement conforme à la Section 1105.2 et les espaces spécifiés dans la Section 1105.4.

source: A clear floor space positioned adjacent to the dishwasher door, shall be provided.
fr_ca: Il faut prévoir une surface de plancher dégagée positionnée à côté de la porte du lave-vaisselle.

source: A clear floor space positioned for a parallel approach shall be provided at a lavatory.
fr_ca: Il faut prévoir une surface de plancher dégagée positionnée pour un accès parallèle au lavabo.

source: A clear floor space positioned for a parallel or forward approach to the refrigerator/freezer shall be provided.
fr_ca: Une surface de plancher dégagée positionnée pour une approche parallèle ou de face du réfrigérateur/congélateur doit être prévue.

source: A clear floor space shall be provided at each kitchen appliance.
fr_ca: Une surface de plancher dégagée doit être prévue à chaque appareil de cuisine.

source: A clear floor space shall be provided for each washing machine and clothes dryer.
fr_ca: Une surface de plancher dégagée doit être prévue pour chaque laveuse et chaque sécheuse.

source: A clear floor space shall be provided on both sides of the bed.
fr_ca: Il faut prévoir une surface de plancher dégagée des deux côtés du lit.

source: A clear floor space shall be provided.
fr_ca: Une surface de plancher dégagée doit être prévue.

source: A clear floor space, positioned adjacent to the dishwasher door, shall be provided.
fr_ca: Il faut prévoir une surface de plancher dégagée, positionnée à côté de la porte du lave-vaisselle.

source: A clear floor space, positioned for a forward approach to the sink, shall be provided.
fr_ca: Il faut prévoir une surface de plancher dégagée, positionnée pour une approche de l'évier par l'avant.

source: A clear floor space, positioned for a forward approach to the work surface, shall be provided.
fr_ca: Il faut prévoir une surface de plancher dégagée, positionnée pour une approche de la surface de travail par l'avant.

source: A clear floor space, positioned for a parallel approach to the refrigerator/freezer, shall be provided.
fr_ca: Il faut prévoir une surface de plancher dégagée, positionnée pour un accès parallèle au réfrigérateur/congélateur.

source: A clear floor space, positioned for a parallel approach to the sink, shall be provided.
fr_ca: Il faut prévoir une surface de plancher dégagée, positionnée pour un accès parallèle à l'évier.

source: A clear floor space, positioned for a parallel or forward approach adjacent to the oven shall be provided.
fr_ca: Un espace libre au sol, positionné de manière à permettre une approche parallèle ou de face à côté du four, doit être prévu.

source: A clear floor space, positioned for a parallel or forward approach to the cooktop, shall be provided.
fr_ca: Une surface de plancher dégagée, positionnée pour une approche parallèle ou de face de la table de cuisson doit être prévue.

source: A clear floor space, positioned for a parallel or forward approach to the dishwasher, shall be provided.
fr_ca: Il faut prévoir une surface de plancher dégagée, positionnée pour une approche parallèle ou par l'avant du lave-vaisselle.

source: A clear floor space, positioned for a parallel or forward approach to the trash compactor, shall be provided.
fr_ca: Un espace libre au sol, positionné de manière à permettre une approche parallèle ou de face du compacteur à déchets, doit être prévu.

source: A clear floor space, positioned for a parallel or forward approach, shall be provided at each kitchen appliance.
fr_ca: Il faut prévoir une surface de plancher dégagée, positionnée pour une approche parallèle ou par l'avant, à chaque appareil de cuisine.

source: A clearance 48 inches (1220 mm) minimum in length measured perpendicular from the control end of the bathtub, and 30 inches (760 mm) minimum in width shall be provided in front of bathtubs.
fr_ca: Un dégagement d'au moins 48 po [1220 mm] en longueur, mesuré perpendiculairement à l'extrémité de commande de la baignoire, et d'au moins 30 po [760 mm] en largeur doit être prévu devant les baignoires.

source: A clearance 60 inches (1525 mm) minimum in length and 30 inches (760 mm) minimum in width shall be provided in front of bathtubs with a parallel approach.
fr_ca: Un dégagement d'au moins 60 po [1525 mm] en longueur et d'au moins 30 po [760 mm] en largeur doit être prévu devant les baignoires à accès parallèle.

source: A clearance 60 inches (1525 mm) minimum in length and 48 inches (1220 mm) minimum in width shall be provided in front of bathtubs with a forward approach.
fr_ca: Un dégagement d'au moins 60 po [1525 mm] en longueur et d'au moins 48 po [1220 mm] en largeur doit être prévu devant les baignoires à accès frontal.

source: A clearance in front of bathtubs extending the length of the bathtub and 30 inches (760 mm) minimum in depth shall be provided.
fr_ca: Il faut prévoir un dégagement devant les baignoires qui s'étend sur toute la longueur de la baignoire et qui a une profondeur minimale de 30 po [760 mm].

source: A clearance of 18 inches (455 mm) minimum from the centerline of the water closet to any side wall or obstruction shall be provided where reinforcement for swing–up grab bars is provided.
fr_ca: Un dégagement d'au moins 18 po [455 mm] entre la ligne d'axe de la cabine de toilette et toute paroi latérale ou obstruction doit être prévu lorsqu'un renforcement pour des barres d'appui relevables est prévu.

source: A clearance of 48 inches (1220 mm) minimum in length, measured perpendicular from the control wall, and 30 inches (760 mm) minimum in depth, measured from the face of the shower compartment, shall be provided.
fr_ca: Un dégagement d'au moins 48 po [1220 mm] en longueur, mesuré perpendiculairement au mur de commande, et d'au moins 30 po [760 mm] en profondeur, mesuré à partir de la face de la cabine de douche, doit être prévu.
